
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8687971536)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
google_firebase_project.default: Refreshing state... [id=projects/lgtmgen-project]
data.google_iam_policy.noauth: Reading...
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
google_firestore_database.datastore_mode_database: Refreshing state... [id=projects/lgtmgen-project/databases/(default)]
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]
google_artifact_registry_repository.main-repo: Refreshing state... [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
data.google_iam_policy.noauth: Read complete after 0s [id=3450855414]
google_cloud_run_service_iam_policy.noauth: Refreshing state... [id=v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend]
google_project_service.firebase_database: Refreshing state... [id=lgtmgen-project/firebasedatabase.googleapis.com]
google_firebase_database_instance.default: Refreshing state... [id=projects/lgtmgen-project/locations/asia-southeast1/instances/lgtmgen-project-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service_iam_policy.noauth will be updated in-place
  ~ resource "google_cloud_run_service_iam_policy" "noauth" {
        id          = "v1/projects/lgtmgen-project/locations/asia-northeast1/services/dev-main-backend"
      ~ policy_data = jsonencode(
          ~ {
              + bindings = [
                  + {
                      + members = [
                          + "allUsers",
                        ]
                      + role    = "roles/run.invoker"
                    },
                ]
            }
        )
        # (4 unchanged attributes hidden)
    }

  # google_cloud_run_v2_service.cloudrun-dev-main-backend will be created
  + resource "google_cloud_run_v2_service" "cloudrun-dev-main-backend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "dev-main-backend"
      + observed_generation     = (known after apply)
      + project                 = "lgtmgen-project"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/nginx:latest"
              + name  = "nginx"

              + ports {
                  + container_port = 80
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "memory" = "1024Mi"
                    }
                }
            }
          + containers {
              + image = "asia-northeast1-docker.pkg.dev/lgtmgen-project/dev-main/backend:latest"
              + name  = "backend"

              + env {
                  + name  = "PORT"
                  + value = "8080"
                }
            }
        }

      + traffic {
          + percent  = 100
          + revision = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
google_cloud_run_v2_service.cloudrun-dev-main-backend: Creating...
╷
│ Error: Error creating Service: googleapi: Error 400: Violation in CreateServiceRequest.service.traffic[0].revision: must be specified if and only if traffic type is TRAFFIC_TARGET_ALLOCATION_TYPE_REVISION.
│ Details:
│ [
│   {
│     "@type": "type.googleapis.com/google.rpc.BadRequest",
│     "fieldViolations": [
│       {
│         "description": "must be specified if and only if traffic type is TRAFFIC_TARGET_ALLOCATION_TYPE_REVISION.",
│         "field": "Violation in CreateServiceRequest.service.traffic[0].revision"
│       }
│     ]
│   }
│ ]
│ 
│   with google_cloud_run_v2_service.cloudrun-dev-main-backend,
│   on cloudrun.tf line 1, in resource "google_cloud_run_v2_service" "cloudrun-dev-main-backend":
│    1: resource "google_cloud_run_v2_service" "cloudrun-dev-main-backend" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":20,"Program":"tfcmt","SHA1":"1f3fec622f9106a594c5ec06beca9977034cfab1","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->